In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('output3.xlsx')
df.head()

,Name,Address,Number
0,Isabella Colagiovanni,1523 1st Ave W\nBradenton FL 34205,(401) 295-2609
1,Wayne Curtiss,330 Inner Harbour Cir\nTampa FL 33602,(239) 543-2126
2,NaN,NaN,NaN
3,Bella Colagiovanni,1523 1st Ave W\nBradenton FL 34205,(941) 484-5504
4,NaN,NaN,NaN

In [4]:
df.isnull().sum()

Name       205
Address    205
Number     345
dtype: int64

In [5]:
df.dropna(subset=['Number'], inplace=True)
df.isnull().sum()

Name       0
Address    0
Number     0
dtype: int64

In [6]:
df.duplicated().sum()

40

In [7]:
df.drop_duplicates(keep='first', inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 717 entries, 0 to 1101
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     717 non-null    object
 1   Address  717 non-null    object
 2   Number   717 non-null    object
dtypes: object(3)
memory usage: 22.4+ KB

In [8]:
df.to_excel('output3.xlsx', index=False)